/*
 * flash.h
 *
 *  Created on: 30.04.2012
 *      Author: Хозяин
 */

#include <avr/pgmspace.h>

const char fcNull[] PROGMEM = "";

const char fcNoConnectBsp[] PROGMEM = " Нет связи с БСП!!! ";

const char fcUout[] PROGMEM = "U=%u.%uВ";
const char fcIout[] PROGMEM	= "I=%uмА";
const char fcRout[] PROGMEM = "R=%uОм";
const char fcUz[] 	PROGMEM	= "Uз=%.2dдБ";
const char fcUcf[] 	PROGMEM	= "Uк=%.2dдБ";
const char fcUn[] 	PROGMEM	= "Uш=%.2dдБ";
const char fcDate[] PROGMEM = "%02d.%02d.%02d";
const char fcTime[] PROGMEM = "%02d:%02d:%02d";

const char fcDef[] PROGMEM = "ЗАЩ:%S%S";
const char fcPrm[] PROGMEM = "ПРМ:%S%S";
const char fcPrd[] PROGMEM = "ПРД:%S%S";

const char fcDDD[] PROGMEM = "Проверка";

// режимы устройств
const char fcRegime[] [9] PROGMEM =
{
	"Выведен ",
	"Готов   ",
	"Введен  ",
	"Речь    ",
	"Тест 1  ",
	"Тест 2  ",
	"Ошибка  "
};

// состояния Защиты
const char fcDefSost[][9] PROGMEM =
{
	"Исходн. ",
	"Контроль",
	"Пуск    ",
	"Работа  ",
	"Неиспр. ",
	"П.неиспр",
	"Ожидание",
	"Нал.пуск",
	"?0х80?  ",
	"Нет РЗ  ",
	"Речь    ",
	"Ошибка  "
};

// состояния Приемника
const char fcPrmSost[] [9] PROGMEM =
{
	"Исходн. ",
	"ПРМ КЧ  ",
	"ПРМ ПА  ",
	"Нет КЧ  ",
	"Неиспр. ",
	"П.неиспр",
	"Ожидание",
	"БЛК КМ  ",
	"?0x08?  ",
	"?0x09?  ",
	"Речь    "
};

// состояния Передатчика
const char fcPrdSost[] [9] PROGMEM =
{
	"Исходн. ",
	"ПРД КЧ  ",
	"ПРД ПА  ",
	"Нет КЧ  ",
	"Неиспр. ",
	"П.неиспр",
	"Ожидание",
	"?0x07?  ",
	"?0x08?  ",
	"Систем. ",
	"Речь    "
};

// Неисправности общие
const char fcGlbError[] [17] PROGMEM =
{
	"Неиспр. 0х0000  ",	// 0х0000
	"Неиспр.чт. FLASH",	// 0x0001
	"Неиспр.зап.FLASH",	// 0x0002
	"Неиспр.чт. PLIS ",	// 0x0004
	"Неиспр.зап.PLIS ",	// 0x0008
	"Неиспр.зап.2RAM ", // 0x0010
	"Неиспр. 0х0020  ",	// 0х0020
	"Неиспр. 0х0040  ",	// 0х0040
	"Неиспр. 0х0080  ",	// 0х0080
	"Неиспр.DSP 2RAM ",	// 0х0100
	"Неиспр.чт. 2RAM ",	// 0х0200
	"Установите часы ",	// 0х0400
	"Низкое напр.вых.",	// 0х0800
	"Высокое напр.вых",	// 0х1000
	"Неиспр. 0х2000  ",	// 0х2000
	"Неиспр. 0х4000  ",	// 0х4000
	"Неиспр. 0х8000  "	// 0х8000
};

// Предупреждения общие
const char fcGlbWarning[] [17] PROGMEM =
{
	"Предупр. 0х0000 ",	// 0х0000
	"Установите часы ", // 0x0001
	"Отказ резерв.лин", // 0х0002
	"Удал.пост неиспр", // 0х0004
	"Удал.ПРД неиспр.", // 0х0008
	"Удал.ПРМ неиспр."	// 0x0010
};

// Неисправности защиты
const char fcDefError[] [17] PROGMEM =
{
	"Неиспр. 0х0000  ",	// 0х0000
	"Нет блока БСЗ   ",	// 0x0001
	"Неиспр.верс.БСЗ ",	// 0x0002
	"Неиспр.перекл.  ",	// 0x0004
	"Неиспр.зап. БСЗ ",	// 0x0008
	"Неиспр. 0х0010  ", // 0x0010
	"Неиспр. 0х0020  ",	// 0х0020
	"Неиспр. 0х0040  ",	// 0х0040
	"Неиспр. 0х0080  ",	// 0х0080
	"Неиспр.вход.ПУСК",	// 0х0100
	"Неиспр.вход.СТОП",	// 0х0200
	"Неиспр. 0х0400  ",	// 0х0400
	"Неиспр.цепь.ВЫХ ",	// 0х0800
	"Неиспр. 0х1000  ",	// 0х1000
	"Неиспр.зап. ВЫХ ",	// 0х2000
	"Нет сигнала РЗ  ",	// 0х4000
	"Неиспр. 0х8000  "	// 0х8000
};

// Предупреждения защиты
const char fcDefWarning[] [17] PROGMEM =
{
	"Предупр. 0х0000 ",	// 0х0000
	"Предупр. 0х0001 ", // 0x0001
	"Предупр. 0х0002 ", // 0х0002
	"Предупр. 0х0004 ", // 0х0004
	"Предупр. 0х0008 "  // 0х0008
};

// Неисправности приемника
const char fcPrmError[] [17] PROGMEM =
{
	"Неиспр. 0х0000  ",	// 0х0000
	"Нет блока БСК   ",	// 0x0001
	"Неиспр.верс.БСК ",	// 0x0002
	"Неиспр.нет КЧ   ",	// 0x0004
	"Прев.дл-сти.ком.",	// 0x0008
	"Неиспр. 0х0010  ", // 0x0010
	"Неиспр. 0х0020  ",	// 0х0020
	"Неиспр. 0х0040  ",	// 0х0040
	"Неиспр. 0х0080  ",	// 0х0080
	"Неиспр.зап. БСК ",	// 0х0100
	"Неиспр.выкл.КСК ",	// 0х0200
	"Неиспр.вкл. КСК ",	// 0х0400
	"Неиспр.контр.КСК",	// 0х0800
	"Предупр.нет КЧ1 ",	// 0х1000
	"Неиспр. 0х2000  ",	// 0х2000
	"Неиспр. 0х4000  ",	// 0х4000
	"Прием блок. Ком."	// 0х8000
};

// Предупреждения приемника
const char fcPrmWarningOptic[] [17] PROGMEM =
{
	"Предупр. 0х0000 ",	// 0х0000
	"Нет КЧ          ", // 0x0001
	"Предупр. 0х0002 ", // 0х0002
	"Предупр. 0х0004 ", // 0х0004
	"Предупр. 0х0008 "  // 0х0008
};

// Неисправности передатчика
const char fcPrdError[] [17] PROGMEM =
{
	"Неиспр. 0х0000  ",	// 0х0000
	"Нет блока БСК   ",	// 0x0001
	"Неиспр.верс.БСК ",	// 0x0002
	"Неиспр. 0х0004  ",	// 0x0004
	"Неиспр. 0х0008  ",	// 0x0008
	"Неиспр. 0х0010  ", // 0x0010
	"Неиспр. 0х0020  ",	// 0х0020
	"Неиспр. 0х0040  ",	// 0х0040
	"Неиспр. 0х0080  ",	// 0х0080
	"Ош.чт. PLIS ПРД ",	// 0х0100
	"Неиспр.выкл.Тест",	// 0х0200
	"Неиспр.вкл. Тест",	// 0х0400
	"Неиспр.вход.КСК ",	// 0х0800
	"Неиспр. 0х1000  ",	// 0х1000
	"Неиспр. 0х2000  ",	// 0х2000
	"Неиспр. 0х4000  ",	// 0х4000
	"Неиспр. 0х8000  "	// 0х8000
};

// Предупреждения передатчика
const char fcPrdWarning[] [17] PROGMEM =
{
	"Предупр. 0х0000 ",	// 0х0000
	"Предупр. 0х0001 ", // 0x0001
	"Предупр. 0х0002 ", // 0х0002
	"Предупр. 0х0004 ", // 0х0004
	"Предупр. 0х0008 "  // 0х0008
};

